fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <comment>Хранит информацию о суммах задолженности клиента</comment>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Область ОписаниеПеременных

// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
Перем ДатаПроведенияРаботСтарая;
Перем ВремяНачалаРаботПланСтарое;
Перем ВремяОкончанияРаботПланСтарое;
Перем ИсполнительСтарый;
Перем НовыйДокумент;
// -- Соколовская О.В. 13.09.2026

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
	НовыйДокумент = ЭтоНовый();
	
	Если Не НовыйДокумент Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
		|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			
			ДатаПроведенияРаботСтарая = Выборка.ДатаПроведенияРабот;
			ВремяНачалаРаботПланСтарое = Выборка.ВремяНачалаРаботПлан;
			ВремяОкончанияРаботПланСтарое = Выборка.ВремяОкончанияРаботПлан;
			ИсполнительСтарый = Выборка.Специалист;
			
		КонецЕсли;
	КонецЕсли;
	// -- Соколовская О.В. 13.09.2026
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
	
	Сообщение = "";
	
	ИсходноеСообщение = СтрШаблон(НСтр("ru = 'Работы у клиента %1 по договору %2 выполнит специалист %3 %4 с %5 по %6.'") ,
				Клиент, Договор, Специалист, 
				Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"), 
				Формат(ВремяНачалаРаботПлан, "ДФ=HH:MM"), 
				Формат(ВремяОкончанияРаботПлан, "ДФ=HH:MM"));
				            
	Если НовыйДокумент Тогда
		
		Сообщение = ИсходноеСообщение;
		
	КонецЕсли;
	
	ИзмененныеПараметры = Новый Соответствие;
		
	Если Не НовыйДокумент И ДатаПроведенияРаботСтарая <> ДатаПроведенияРабот Тогда
		
		ИзмененныеПараметры.Вставить("Дата проведения работ", Формат(ДатаПроведенияРаботСтарая,"ДФ=dd.MM.yyyy"));
		
	КонецЕсли;
				
	Если Не НовыйДокумент  И 
		 (ВремяНачалаРаботПланСтарое <> ВремяНачалаРаботПлан ИЛИ
		  ВремяОкончанияРаботПланСтарое <> ВремяОкончанияРаботПлан) Тогда
		
		ИзмененныеПараметры.Вставить("Время", "с " + Формат(ВремяНачалаРаботПланСтарое, "ДФ=HH:MM") + 
									" по " + Формат(ВремяОкончанияРаботПланСтарое, "ДФ=HH:MM"));
		
	КонецЕсли;
	
	Если Не НовыйДокумент И ИсполнительСтарый <> Специалист	Тогда
					
		ИзмененныеПараметры.Вставить("Исполнитель", ИсполнительСтарый);
					
	КонецЕсли;
				   				   
	Если Не ПустаяСтрока(Сообщение) Тогда
		
		Сообщение = ИзмененноеСообщение(Сообщение, ИзмененныеПараметры);
		
		СправочникСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		СправочникСообщение.ТекстСообщения = Сообщение;
		СправочникСообщение.Записать();
		
	КонецЕсли;
	// -- Соколовская О.В. 13.09.2026
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВидДоговора КАК ДоговорВидДоговора,
		|	ВКМ_ОбслуживаниеКлиентов.Дата КАК Период,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ПериодДействияНачало КАК ДатаНачалаДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_ПериодДействияКонец КАК ДатаОкончанияДействияДоговора,
		|	ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботыПоДоговору,
		|	ВКМ_ОбслуживаниеКлиентов.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиентов.Договор КАК Договор,
		|	РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРаботПлан, ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРаботПлан, ЧАС) КАК КоличествоЧасов,
		|	РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРаботПлан, ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРаботПлан, ЧАС) * ВКМ_ОбслуживаниеКлиентов.Договор.ВКМ_СтоимостьЧасаРаботы КАК СуммаКОплате
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Если Выборка.ДоговорВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда

		Отказ = Истина;
		Сообщение = НСтр("ru = 'Вид договора должен быть ""Абонентская плата""'");
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		Возврат;
		
	КонецЕсли;
	
	Если Выборка.ДатаНачалаДействияДоговора > Выборка.Период Тогда
		
		Отказ = Истина;
		Сообщение = СтрШаблон(НСтр("ru = 'Договор действует с %1'"), 
					Формат(Выборка.ДатаНачалаДействияДоговора,"ДФ=dd.MM.yyyy"));
		
	ИначеЕсли Выборка.ДатаОкончанияДействияДоговора < Выборка.Период Тогда
		
		Отказ = Истина;
		Сообщение = СтрШаблон(НСтр("ru = 'Срок действия договора истек %1'"), 
					Формат(Выборка.ДатаОкончанияДействияДоговора,"ДФ=dd.MM.yyyy"));
					
	КонецЕсли;
	
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		Возврат;
	КонецЕсли;
	

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьПриход();
	ЗаполнитьЗначенияСвойств(Движение, Выборка);
	// -- Соколовская О.В. 13.09.2026
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
Функция ИзмененноеСообщение(Сообщение, ИзмененныеПараметры)
	
	Для Каждого Стр Из ИзмененныеПараметры Цикл
		Сообщение = СтрШаблон(НСтр("ru = '%1 Изменено: %2, старое значение: %3.'"), 
					Сообщение, Стр.Ключ, Стр.Значение);
	КонецЦикла;
	
	Возврат Сообщение;
	
КонецФункции // -- Соколовская О.В. 13.09.2026

// ++ Соколовская О.В. 14.09.2026 Заполнение реализации товаров и услуг
Процедура ВыполнитьАвтозаполнение() Экспорт
	
	
	
КонецПроцедуры  // -- Соколовская О.В. 14.09.2026

#КонецОбласти
